RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/LPC55S6X/arm/startup_LPC55S69_cm33_core1.s
SEC_HYPERVISOR_CALL_IRQHandler\
                PROC
                EXPORT     SEC_HYPERVISOR_CALL_IRQHandler        [WEAK]
                LDR        R0, =SEC_HYPERVISOR_CALL_DriverIRQHandler
                BX         R0
                ENDP

SEC_GPIO_INT0_IRQ0_IRQHandler\
                PROC
                EXPORT     SEC_GPIO_INT0_IRQ0_IRQHandler        [WEAK]
                LDR        R0, =SEC_GPIO_INT0_IRQ0_DriverIRQHandler
                BX         R0
                ENDP

SEC_GPIO_INT0_IRQ1_IRQHandler\
                PROC
                EXPORT     SEC_GPIO_INT0_IRQ1_IRQHandler        [WEAK]
                LDR        R0, =SEC_GPIO_INT0_IRQ1_DriverIRQHandler
                BX         R0
                ENDP

PLU_IRQHandler\
                PROC
                EXPORT     PLU_IRQHandler        [WEAK]
                LDR        R0, =PLU_DriverIRQHandler
                BX         R0
                ENDP

SEC_VIO_IRQHandler\
                PROC
                EXPORT     SEC_VIO_IRQHandler        [WEAK]
                LDR        R0, =SEC_VIO_DriverIRQHandler
                BX         R0
                ENDP

HASHCRYPT_IRQHandler\
                PROC
                EXPORT     HASHCRYPT_IRQHandler        [WEAK]
                LDR        R0, =HASHCRYPT_DriverIRQHandler
                BX         R0
                ENDP

CASER_IRQHandler\
                PROC
                EXPORT     CASER_IRQHandler        [WEAK]
                LDR        R0, =CASER_DriverIRQHandler
                BX         R0
                ENDP

PUF_IRQHandler\
                PROC
                EXPORT     PUF_IRQHandler        [WEAK]
                LDR        R0, =PUF_DriverIRQHandler
                BX         R0
                ENDP

PQ_IRQHandler\
                PROC
                EXPORT     PQ_IRQHandler        [WEAK]
                LDR        R0, =PQ_DriverIRQHandler
                BX         R0
                ENDP

DMA1_IRQHandler\
                PROC
                EXPORT     DMA1_IRQHandler        [WEAK]
                LDR        R0, =DMA1_DriverIRQHandler
                BX         R0
                ENDP

FLEXCOMM8_IRQHandler\
                PROC
                EXPORT     FLEXCOMM8_IRQHandler        [WEAK]
                LDR        R0, =FLEXCOMM8_DriverIRQHandler
                BX         R0
                ENDP

Default_Handler PROC
                EXPORT     WDT_BOD_DriverIRQHandler        [WEAK]
                EXPORT     DMA0_DriverIRQHandler        [WEAK]
                EXPORT     GINT0_DriverIRQHandler        [WEAK]
                EXPORT     GINT1_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT0_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT1_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT2_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT3_DriverIRQHandler        [WEAK]
                EXPORT     UTICK0_DriverIRQHandler        [WEAK]
                EXPORT     MRT0_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER0_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER1_DriverIRQHandler        [WEAK]
                EXPORT     SCT0_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER3_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM0_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM1_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM2_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM3_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM4_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM5_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM6_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM7_DriverIRQHandler        [WEAK]
                EXPORT     ADC0_DriverIRQHandler        [WEAK]
                EXPORT     Reserved39_DriverIRQHandler        [WEAK]
                EXPORT     ACMP_DriverIRQHandler        [WEAK]
                EXPORT     Reserved41_DriverIRQHandler        [WEAK]
                EXPORT     Reserved42_DriverIRQHandler        [WEAK]
                EXPORT     USB0_NEEDCLK_DriverIRQHandler        [WEAK]
                EXPORT     USB0_DriverIRQHandler        [WEAK]
                EXPORT     RTC_DriverIRQHandler        [WEAK]
                EXPORT     Reserved46_DriverIRQHandler        [WEAK]
                EXPORT     MAILBOX_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT4_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT5_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT6_DriverIRQHandler        [WEAK]
                EXPORT     PIN_INT7_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER2_DriverIRQHandler        [WEAK]
                EXPORT     CTIMER4_DriverIRQHandler        [WEAK]
                EXPORT     OS_EVENT_DriverIRQHandler        [WEAK]
                EXPORT     Reserved55_DriverIRQHandler        [WEAK]
                EXPORT     Reserved56_DriverIRQHandler        [WEAK]
                EXPORT     Reserved57_DriverIRQHandler        [WEAK]
                EXPORT     SDIO_DriverIRQHandler        [WEAK]
                EXPORT     Reserved59_DriverIRQHandler        [WEAK]
                EXPORT     Reserved60_DriverIRQHandler        [WEAK]
                EXPORT     Reserved61_DriverIRQHandler        [WEAK]
                EXPORT     USB1_UTMI_DriverIRQHandler        [WEAK]
                EXPORT     USB1_DriverIRQHandler        [WEAK]
                EXPORT     USB1_NEEDCLK_DriverIRQHandler        [WEAK]
                EXPORT     SEC_HYPERVISOR_CALL_DriverIRQHandler        [WEAK]
                EXPORT     SEC_GPIO_INT0_IRQ0_DriverIRQHandler        [WEAK]
                EXPORT     SEC_GPIO_INT0_IRQ1_DriverIRQHandler        [WEAK]
                EXPORT     PLU_DriverIRQHandler        [WEAK]
                EXPORT     SEC_VIO_DriverIRQHandler        [WEAK]
                EXPORT     HASHCRYPT_DriverIRQHandler        [WEAK]
                EXPORT     CASER_DriverIRQHandler        [WEAK]
                EXPORT     PUF_DriverIRQHandler        [WEAK]
                EXPORT     PQ_DriverIRQHandler        [WEAK]
                EXPORT     DMA1_DriverIRQHandler        [WEAK]
                EXPORT     FLEXCOMM8_DriverIRQHandler        [WEAK]

